src/InformationRegisters/ТекущееСостояниеОповещения/ТекущееСостояниеОповещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекущееСостояниеОповещения</name>
  <resources>
    <name>СформированоОповещение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Отправлено</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>УровеньИнцидента</name>
    <type>
      <types>EnumRef.УровниИнцидентов</types>
    </type>
  </resources>
  <dimensions>
    <name>Оповещение</name>
    <type>
      <types>CatalogRef.Оповещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Инцидент</name>
    <type>
      <types>CatalogRef.Инциденты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ТекущееСостояниеОповещения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ЗаписатьИнцидент(ОповещениеИнцидента, Инцидент, Статус, Уровень, СформированоОповещение) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ТекущееСостояниеОповещения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Оповещение = ОповещениеИнцидента;
	МенеджерЗаписи.Инцидент = Инцидент;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Оповещение = ОповещениеИнцидента;
	МенеджерЗаписи.Инцидент = Инцидент;
    
	Если НЕ ЗначениеЗаполнено(МенеджерЗаписи.ДатаСоздания) Тогда
		МенеджерЗаписи.ДатаСоздания = ТекущаяУниверсальнаяДата();
    КонецЕсли;
    
	Если НЕ МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.СформированоОповещение = СформированоОповещение;
	КонецЕсли;
    
    Если МенеджерЗаписи.Выбран() И МенеджерЗаписи.УровеньИнцидента <> Уровень Тогда
        МенеджерЗаписи.СформированоОповещение = Ложь;
    КонецЕсли;
    
    МенеджерЗаписи.УровеньИнцидента = Уровень;
    	
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Процедура УстановитьСформированоОповещение(Оповещение, ИнцидентыСоответствие) Экспорт
	
	ТекДата = ТекущаяУниверсальнаяДата();
	
	НаборЗаписей = РегистрыСведений.ТекущееСостояниеОповещения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Оповещение.Установить(Оповещение);
	НаборЗаписей.Прочитать();
	Для Каждого ТекЗапись Из НаборЗаписей Цикл
		Если ИнцидентыСоответствие[ТекЗапись.Инцидент] <> Неопределено Тогда
			ТекЗапись.СформированоОповещение = Истина;
		КонецЕсли;
	КонецЦикла;
			
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

Процедура ЗакрытьОповещение(Оповещение) Экспорт
	
	НаборЗаписей = РегистрыСведений.ТекущееСостояниеОповещения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Оповещение.Установить(Оповещение);
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
